qpacsystems/1704165-Bootloader/lib/cyclone_boot/drivers/flash/internal/stm32h5xx_flash_driver.c
/**
 * @file stm32h5xx_flash_driver.c
 * @brief CycloneBOOT STM32H5xx Flash Driver
 *
 * @section License
 *
 * Copyright (C) 2021-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneBOOT Open
 * 
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

// Switch to the appropriate trace level
#define TRACE_LEVEL CBOOT_DRIVER_TRACE_LEVEL

// Dependencies
#include "stm32h5xx_flash_driver.h"

#include "core/flash.h"
#include "debug.h"
#include "stm32h5xx.h"
#include "stm32h5xx_hal.h"

// Sector list size
#define SECTORS_LIST_LEN 1

/**
 * @brief Sector group description
 **/

typedef struct
{
   uint32_t addr;
   uint32_t size;
   uint32_t nb;
} SectorsGroup;

// Internal flash memory sectors list
static const SectorsGroup sectorsList[SECTORS_LIST_LEN] = {
   {STM32H5xx_FLASH_ADDR, STM32H5xx_FLASH_SECTOR_SIZE, STM32H5xx_FLASH_SECTOR_NUMBER}
};

// private functions
error_t stm32h5xxFlashDriverInit(void);
error_t stm32h5xxFlashDriverDeInit(void);
error_t stm32h5xxFlashDriverGetInfo(const FlashInfo **info);
error_t stm32h5xxFlashDriverGetStatus(FlashStatus *status);
error_t stm32h5xxFlashDriverWrite(uint32_t address, uint8_t *data, size_t length);
error_t stm32h5xxFlashDriverRead(uint32_t address, uint8_t *data, size_t length);
error_t stm32h5xxFlashDriverErase(uint32_t address, size_t length);
error_t stm32h5xxFlashDriverSwapBanks(void);
error_t stm32h5xxFlashDriverGetNextSector(uint32_t address, uint32_t *sectorAddr);
bool_t stm32h5xxFlashDriverIsSectorAddress(uint32_t address);

error_t stm32h5xxFlashDriverWriteQuadWord(uint32_t address, uint32_t quadWord);
int_t stm32h5xxFlashGetSector(uint32_t address);
error_t stm32h5xxFlashDriverEraseSector(uint32_t bankID, uint32_t firstSector, size_t nbSectors);
error_t flashGetCurrentBank(uint8_t *fBankID);

uint32_t GetBank(uint32_t Addr);
uint32_t GetSector(uint32_t Address);
uint32_t CountSectorsToDelete(uint32_t StartAddress, uint32_t EndAddress);
uint32_t GetSectorSingleBank(uint32_t Address);
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

/**
 * @brief Memory Information
 **/

const FlashInfo stm32h5xxFlashDriverInfo = {.version = FLASH_DRIVER_VERSION,
                                            .flashName = STM32H5xx_FLASH_NAME,
                                            .flashType = FLASH_TYPE_INTERNAL,
                                            .flashAddr = STM32H5xx_FLASH_ADDR,
                                            .flashSize = STM32H5xx_FLASH_SIZE,
                                            .writeSize = STM32H5xx_FLASH_WRITE_SIZE,
                                            .readSize = STM32H5xx_FLASH_READ_SIZE,
#ifndef FLASH_DB_MODE
                                            .dualBank = 0,
                                            .bankSize = 0,
                                            .bank1Addr = 0,
                                            .bank2Addr = 0,
                                            .flags = 0
#else
                                            .dualBank = 1,
                                            .bankSize = STM32H5xx_FLASH_BANK_SIZE,
                                            .bank1Addr = STM32H5xx_FLASH_BANK1_ADDR,
                                            .bank2Addr = STM32H5xx_FLASH_BANK2_ADDR,
                                            .flags = FLASH_FLAGS_LATER_SWAP
#endif
};

/**
 * @brief STM32h7xx Flash driver
 **/

const FlashDriver stm32h5xxFlashDriver = {
   .init = stm32h5xxFlashDriverInit,
   .deInit = stm32h5xxFlashDriverDeInit,
   .getInfo = stm32h5xxFlashDriverGetInfo,
   .getStatus = stm32h5xxFlashDriverGetStatus,
   .write = stm32h5xxFlashDriverWrite,
   .read = stm32h5xxFlashDriverRead,
   .erase = stm32h5xxFlashDriverErase,
#ifndef FLASH_DB_MODE
   .swapBanks = NULL,
#else
   .swapBanks = stm32h5xxFlashDriverSwapBanks,
#endif
   .getNextSectorAddr = stm32h5xxFlashDriverGetNextSector,
   .isSectorAddr = stm32h5xxFlashDriverIsSectorAddress,
};

/**
 * @brief Initialize Flash Memory.
 * @return Error code
 **/

error_t stm32h5xxFlashDriverInit(void)
{

   TRACE_INFO("Initializing %s memory...\r\n", STM32H5xx_FLASH_NAME);

   // Wait for last flash operation on flash bank 1
   FLASH_WaitForLastOperation(50);
   // Clear all flash bank 1 flags
   __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);

   // Successfull process
   return NO_ERROR;
}

/**
 * @brief De-Initialize Flash Memory.
 * @return Error code
 **/

error_t stm32h5xxFlashDriverDeInit(void)
{
   return ERROR_NOT_IMPLEMENTED;
   ;
}

/**
 * @brief Get Flash Memory information.
 * @param[in,out] info Pointeur to the Memory information structure to be
 * returned
 * @return Error code
 **/

error_t stm32h5xxFlashDriverGetInfo(const FlashInfo **info)
{
   // Set Memory information pointer
   *info = (const FlashInfo *)&stm32h5xxFlashDriverInfo;

   // Successfull process
   return NO_ERROR;
}

/**
 * @brief Get Flash Memory status.
 * @param[in,out] status Pointeur to the Memory status to be returned
 * @return Error code
 **/

error_t stm32h5xxFlashDriverGetStatus(FlashStatus *status)
{
   uint32_t flag;

