qpacsystems/1704165-Bootloader/lib/cyclone_boot/drivers/flash/internal/stm32h5xx_flash_driver.c
#ifndef FLASH_DB_MODE
   // Check parameters validity (is data in flash)
   if((address + sizeof(uint32_t) >= topAddress) || (address % sizeof(uint32_t) != 0))
      return ERROR_INVALID_PARAMETER;
#else
   // Check parameters validity (is data in flash bank 1 or 2 only)
   if(!((address >= STM32H5xx_FLASH_BANK1_ADDR &&
      address + sizeof(uint32_t) <= STM32H5xx_FLASH_BANK2_ADDR) ||
      (address >= STM32H5xx_FLASH_BANK2_ADDR && address + sizeof(uint32_t) <= topAddress)) ||
      (address % sizeof(uint32_t) != 0))
      return ERROR_INVALID_PARAMETER;
#endif

   // Unlock FLASH
   HAL_FLASH_Unlock();

   do
   {
      // Get flash sector number according to the given wirte address
      //  (-1 if it doesn't match a flash sector start address)
      flashSector = stm32h5xxFlashGetSector(address);

      // Is write address match a flash sector start address?
      if(flashSector >= 0)
      {
#if defined(FLASH_DB_MODE)
         // Sector number MUST be within flash bank sector boundaries (each bank
         // has half of the total number of sectors)
         flashSector = flashSector % (STM32H5xx_FLASH_SECTOR_NUMBER / 2);

         // Determine the nno-executing flash bank to be erased
         flashGetCurrentBank(&bankId);
         if(bankId == STM32H5xx_FLASH_BANK1_ID)
         {
            bankId = FLASH_BANK_2;
         }
         else
         {
            bankId = FLASH_BANK_1;
         }
#else
         // Sector number MUST be within flash bank sector boundaries (each bank
         // has half of the total number of sectors)
         flashSector = GetSector(address);
         bankId = GetBank(address);
#endif

         // Set flash erase settings
         EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
         EraseInitStruct.Banks = bankId;
         EraseInitStruct.Sector = flashSector;
         EraseInitStruct.NbSectors = 1;

         // Wait for the last flash operation
         FLASH_WaitForLastOperation((uint32_t)5000U);

         // Erase the sector
         status = HAL_FLASHEx_Erase(&EraseInitStruct, &sectorError);
         if(status != HAL_OK)
         {
            // Debug message
            TRACE_ERROR("Flash erase failed!\r\n");
            break;
         }
      }

      // Write word (256bits) into flash
      status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, address, (uint32_t)quadWord);
      if(status != HAL_OK)
      {
         // Debug message
         TRACE_ERROR("Flash program failed!\r\n");
         break;
      }
   } while(0);

   // Lock FLASH
   HAL_FLASH_Lock();

   // Return error code
   return (status != HAL_OK) ? ERROR_FAILURE : NO_ERROR;
}

/**
 * @brief Get the Memory Flash sector number according to the given address.
 * @param[in] address Given Flash Memory address
 * @return Sector number or -1
 **/

int_t stm32h5xxFlashGetSector(uint32_t address)
{
   uint_t i;
   uint_t j;
   int_t sector;
   SectorsGroup *sGroup;

   // Initialize sector number
   sector = -1;

   // Loop through flash sector group list
   for(i = 0; i < SECTORS_LIST_LEN; i++)
   {
      // Point to the current sector group
      sGroup = (SectorsGroup *)&sectorsList[i];

      // Loop through sector group sectors list
      for(j = 0; j < sGroup->nb; j++)
      {
         // Is current sector address matches given address?
         if(sGroup->addr + sGroup->size * j == address)
         {
            sector = j;
         }
      }
   }

   return sector;
}

/**
 * @brief Erase given number of sector from Flash memory starting from the given
 * index sector.
 * @param[in] firstSector Index of the first Flash memory sector to be erased
 * @param[in] nbSectors Number of Flash memory sector to be erased
 * @return Error code
 **/

error_t stm32h5xxFlashDriverEraseSector(uint32_t bankID, uint32_t firstSector, size_t nbSectors)
{
   HAL_StatusTypeDef status;
   FLASH_EraseInitTypeDef EraseInitStruct;
   uint32_t sectorError;
   uint32_t flashError;

   // Check parameter validity
   if((firstSector >= STM32H5xx_FLASH_SECTOR_NUMBER) || (nbSectors == 0) ||
      ((firstSector + nbSectors - 1) >= STM32H5xx_FLASH_SECTOR_NUMBER))
      return ERROR_INVALID_PARAMETER;

   // Debug message
   // TRACE_DEBUG("Erasing Flash sector(s) %" PRIu32 "through %" PRIu32
   // "...\r\n", firstSectorNumber, lastSectorNumber);
   HAL_ICACHE_Disable();

   // Allow access to Flash control registers
   status = HAL_FLASH_Unlock();
   // Is any error?
   if(status != HAL_OK)
   {
      // Debug message
      TRACE_ERROR("Flash Control Register unlock failed!\r\n");
      return CBOOT_ERROR_FAILURE;
   }

   // Start of exception handling block
   do
   {
      // Set flash erase settings
      EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
      EraseInitStruct.Banks = bankID;
      EraseInitStruct.Sector = firstSector;
      EraseInitStruct.NbSectors = nbSectors;

      // Wait for the last flash operation
      // FLASH_WaitForLastOperation((uint32_t)5000U);

      // Erase the specified Flash sector(s)
      status = HAL_FLASHEx_Erase(&EraseInitStruct, &sectorError);

      // Is any error?
      if(status != HAL_OK)
      {
         // Debug message
         flashError = HAL_FLASH_GetError();
         TRACE_ERROR("Failed to erase flash sector(s) %lu, sector = 0x%08lx, "
            "error = %lu\r\n",
            firstSector, sectorError, flashError);
         (void)flashError; // prevent unused-but-set warning
         break;
      }
   } while(0);

   // Disable the Flash option control register access (recommended to protect
   // the option Bytes against possible unwanted operations)
   if(HAL_FLASH_Lock() != HAL_OK)
   {
      // Debug message
      TRACE_ERROR("Flash Control Register lock failed!\r\n");
      return CBOOT_ERROR_FAILURE;
   }

   HAL_ICACHE_Enable();
   // Return status code
   return (status == HAL_OK) ? NO_ERROR : ERROR_FAILURE;
}

#ifdef FLASH_DB_MODE

/**
 * @brief Get current used flash bank (STM32H5xx_FLASH_BANK1_ID or
 * STM32H5xx_BANK_2_ID).
 * @param[out] fBankID Pointer to the flash bank ID to be retrieved
 * @return Status code
 **/

