qpacsystems/1704165-Bootloader/lib/cyclone_boot/drivers/flash/internal/stm32h5xx_flash_driver.c
error_t flashGetCurrentBank(uint8_t *fBankID)
{
   FLASH_OBProgramInitTypeDef OBInit;
   /* Get the boot configuration status */
   HAL_FLASHEx_OBGetConfig(&OBInit);

   /* Check Swap Flash banks  status */
   if((OBInit.USERConfig & OB_SWAP_BANK_ENABLE) == OB_SWAP_BANK_DISABLE)
   {
      /*Active Bank is bank 1 */
      *fBankID = STM32H5xx_FLASH_BANK1_ID;
   }
   else
   {
      /*Active Bank is bank 2 */
      *fBankID = STM32H5xx_FLASH_BANK2_ID;
   }
   // Successful process
   return NO_ERROR;
}

#else

static inline uint32_t GetFlashSize(void)
{
   volatile uint16_t *sizeReg = (uint16_t *)FLASHSIZE_BASE;

   if(sizeReg == NULL)
   {
      return FLASH_SIZE_DEFAULT;   // Prevent hardfault
   }

   uint16_t size = *sizeReg;

   if(size == 0xFFFFU || size == 0x0000U)
   {
      return FLASH_SIZE_DEFAULT;
   }

   return ((uint32_t)size << 10U);
}

/**
 * @brief  Gets the sector of a given address
 * @param  Addr: Address of the FLASH Memory
 * @retval The sector of a given address
 */
uint32_t GetSector(uint32_t Address)
{
   uint32_t sector = 0;

   if((Address >= FLASH_BASE) && (Address < FLASH_BASE + FLASH_BANK_SIZE))
   {
      sector = (Address & ~FLASH_BASE) / FLASH_SECTOR_SIZE;
   }
   else if((Address >= FLASH_BASE + FLASH_BANK_SIZE) && (Address < FLASH_BASE + FLASH_SIZE))
   {
      sector = ((Address & ~FLASH_BASE) - FLASH_BANK_SIZE) / FLASH_SECTOR_SIZE;
   }
   else
   {
      sector = 0xFFFFFFFF;   /* Address out of range */
   }

   return sector;
}

uint32_t CountSectorsToDelete(uint32_t StartAddress, uint32_t EndAddress)
{
   if(StartAddress > EndAddress)
   {
      // Swap addresses if in reverse order
      uint32_t temp = StartAddress;
      StartAddress = EndAddress;
      EndAddress = temp;
   }

   uint32_t startSector = GetSectorSingleBank(StartAddress);
   uint32_t endSector = GetSectorSingleBank(EndAddress);

   if(startSector == 0xFFFFFFFF || endSector == 0xFFFFFFFF)
   {
      return 0xFFFFFFFF;   // Invalid addresses
   }

   return (startSector > endSector) ? (startSector - endSector + 1)
          : (endSector - startSector + 1);
}

uint32_t GetSectorSingleBank(uint32_t Address)
{
   if(Address < FLASH_BASE || Address >= FLASH_BASE + FLASH_SIZE_DEFAULT)
   {
      return 0xFFFF;   // Invalid address
   }
   return (Address - FLASH_BASE) / FLASH_SECTOR_SIZE;
}
#endif

/**
 * @brief  Gets the bank of a given address
 * @param  Addr: Address of the FLASH Memory
 * @retval The bank of a given address
 */
uint32_t GetBank(uint32_t Addr)
{
   uint32_t bank = 0;

   if(READ_BIT(FLASH->OPTSR_CUR, FLASH_OPTSR_SWAP_BANK) == 0)
   {
      /* No Bank swap */
      if(Addr < (FLASH_BASE + FLASH_BANK_SIZE))
      {
         bank = FLASH_BANK_1;
      }
      else
      {
         bank = FLASH_BANK_2;
      }
   }
   else
   {
      /* Bank swap */
      if(Addr < (FLASH_BASE + FLASH_BANK_SIZE))
      {
         bank = FLASH_BANK_2;
      }
      else
      {
         bank = FLASH_BANK_1;
      }
   }

   return bank;
}
